s = "87 0o145 0x6c 99 0o157 0o155 0x65 0o40 116 0o157 32 112 97 0x72 116 105 0o143 0x69 0x70 0x61 0o164 0x65 0o40 105 0o156 0o40 0x74 104 0x65 0o40 0o110 74 83 69 0o103 0x20 0o141 115 115 0x65 0x73 115 0x6d 0x65 0x6e 0x74 0o56 0x20 84 0x68 0o145 32 0o146 0x6c 0x61 0o147 32 0x69 115 32 72 74 0o123 0o105 0x43 0x20 0o173 0o105 110 106 0o157 121 0x20 0o171 0x6f 0o165 0x72 0o40 0x6c 0x69 102 101 44 0x20 0o160 0x61 0o163 0o163 101 0x73 0x21 0x7d 0o56 0o40 0x54 104 0o151 115 0x20 0o151 0x73 32 0o141 0x20 0x73 0x65 110 0x74 0o145 0x6e 99 101 0o40 0o146 0x72 0o157 109 32 0o164 104 0x65 0o40 0o146 0o157 " \
"0o162 0o155 0x65 0o162 0o40 0x6d 105 110 0x69 0o163 116 0o145 0o162"#输入一个字符串

def to_char(t):           #定义函数
    if t.startswith('0o'):            #用startswith可以索引前缀
        n = int(t[2:], 8)       #将前缀的后两位从八进制转换
    elif t.startswith('0x'):      #同理
        n = int(t[2:], 16)        #同理
    else:
        n = int(t)
    return chr(n)             #转为ascii字符

print(''.join(to_char(t) for t in s.split()))
